org-files/index.org
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="css/stylesheet.css" />
#+Title: Applied Economic Analysis
#+Author: Jan Boone
#+OPTIONS: toc:2 timestamp:nil toc:nil todo:nil
#+EXPORT_EXCLUDE_TAGS: noexport

This website contains the material for the MSc course Applied Economics 1.

**This website is under construction for 2022/2023**

This year the course is taught by:
+ Jan Boone
+ Mery Ferrando
+ Joyce Ladenstein
+ Barbora Písecká


* Python track AEA
  :PROPERTIES:
  :CUSTOM_ID:       python_track_AEA
  :END:

For this course we use the following resources:

+ Jean Tirole, [[https://press.princeton.edu/titles/10919.html][Economics for the Common Good]],
+ [[https://www.datacamp.com/about][Datacamp]]

#+TOC: headlines 2

* Screencasts
  :PROPERTIES:
  :CUSTOM_ID:       screencasts_AEA
  :END:

For this course a series of screencasts is available. The screencasts can be found on this [[file:./pagescreencasts.org][webpage.]]


* Organisation of the course

Since we have recorded screencasts, we will not repeat these during the lectures. The lectures are meant for interaction (only).

** we will use the following format:

+ in the python lectures we will answer questions that you ask us
+ in order to prepare these answers, it is useful if you create an issue via [[https://github.com/janboone/applied-economics/issues][this link]]
  + using the link, create an "issue" where you explain what your question is: what did you try and why did it not work?
    + hence not a something like "I do not know the answer to: *Question* Calculate the total welfare that this planner can achieve. Denote this value ~max_welfare~."
    + but "I tried to calculate total welfare in the following way ... but then I get the following error ..."
    + describing your question like this, helps you better understand what your problem is
    + and it helps us to answer the question in class.
+ for us to be able to prepare these answers, submit the issue on the Friday before the week in which we discuss the topic
  + hence, finish the sections in the week before they are discussed in class
  + if you can solve everything yourself, there is no need to attend the lecture (but you are, of course, welcome to do so)
  + this is one of the advantages of programming: you can see for yourself whether it works or not.

A suggested workflow for the python track is:
+ follow the Datacamp courses and make notes of what you learn at Datacamp in a notebook on the jupyterlab server
  + in this way it is easy to refer back to useful code snippets that you see on Datacamp
+ go through the jupyter notebook for the lecture and try to answer the questions and assignments
+ if you get stuck with a problem, watch the corresponding screencast for this part. It gives hints and ways to solve the questions in the notebook
+ if you still cannot figure it out, create an issue on github to ask us
+ we will answer your questions in class

Two weeks in November will be focused on gender economics. In the lectures Mery will discuss some papers on this topic. There is a notebook where the models discussed are simulated in Python. These notebooks are then discussed at the end of the week. The notebooks will teach you something about gender economics and Python. At the same time, they show you what we expect you to do in the final assignment for this course: take an existing theory paper and solve the model in Python and simulate outcomes of the model.

We highly recommend that you read the book by Jean Tirole to get an idea how you can communicate economic models to a non-economic audience. This will be useful both for your final assignment and for writing your MSc thesis.

*Remark:* We have been teaching this course for a couple of years now. Every year there are a number of students who attend the lectures without preparing anything and watch the screencasts without trying to program themselves. We live in a free country and you choose how to spend your time. However, this strategy does not work well. You actually end up spending far more time on finishing the course than when you follow the planning we suggest below. The reason is as follows: learning a programming language is frustrating. You learn by making mistakes and then trying to figure out what goes wrong. When you make these mistakes during the semester, you are well covered: we are there to help you. When you make these mistakes for the first time when trying to finish your assignment before the deadline, you are in trouble. We will try to help you but not within an hour, or within a day. And because you need to finish before the deadline, you have to figure everything out by yourself under time pressure. Not a pleasant experience and one you can easily avoid. But the choice is yours.

