index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Applied Economic Analysis</title>
<meta name="author" content="Jan Boone" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="css/stylesheet.css" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Applied Economic Analysis</h1>
<p>
This website contains the material for the MSc course Applied Economics 1.
</p>

<p>
<b><b>This website is under construction for 2022/2023</b></b>
</p>

<p>
This year the course is taught by:
</p>
<ul class="org-ul">
<li>Jan Boone</li>
<li>Mery Ferrando</li>
<li>Joyce Ladenstein</li>
<li>Barbora Písecká</li>
</ul>


<div id="outline-container-python_track_AEA" class="outline-2">
<h2 id="python_track_AEA">Python in AEA</h2>
<div class="outline-text-2" id="text-python_track_AEA">
<p>
For this course we use the following resources:
</p>

<ul class="org-ul">
<li>Jean Tirole, <a href="https://press.princeton.edu/titles/10919.html">Economics for the Common Good</a>,</li>
<li><a href="https://www.datacamp.com/about">Datacamp</a></li>
</ul>

<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#python_track_AEA">Python in AEA</a></li>
<li><a href="#screencasts_AEA">Screencasts</a></li>
<li><a href="#orgb6f1889">Organisation of the course</a>
<ul>
<li><a href="#orgb413fb2">we will use the following format:</a></li>
<li><a href="#lecture_schedule_AEA">Lecture schedule</a></li>
<li><a href="#org764cdea">First Lecture</a></li>
<li><a href="#org30625a3">Datacamp</a></li>
<li><a href="#deadlines_AEA">Deadlines</a></li>
<li><a href="#org7e58d60">Questions</a></li>
</ul>
</li>
<li><a href="#final_assignment_AEA">Final Assignment</a>
<ul>
<li><a href="#org75faf65">what we are looking for</a></li>
<li><a href="#orge9ee6a9">resit of final assignment</a></li>
</ul>
</li>
<li><a href="#org615c70e">Python as programming language</a>
<ul>
<li><a href="#orge16ffe4">Jupyter notebooks</a></li>
</ul>
</li>
</ul>
</div>
</div>
</div>
</div>

<div id="outline-container-screencasts_AEA" class="outline-2">
<h2 id="screencasts_AEA">Screencasts</h2>
<div class="outline-text-2" id="text-screencasts_AEA">
<p>
For this course a series of screencasts is available. The screencasts can be found on this <a href="./pagescreencasts.html">webpage.</a>
</p>
</div>
</div>


<div id="outline-container-orgb6f1889" class="outline-2">
<h2 id="orgb6f1889">Organisation of the course</h2>
<div class="outline-text-2" id="text-orgb6f1889">
<p>
Since we have recorded screencasts, we will not repeat these during the lectures. The lectures are meant for interaction (only).
</p>
</div>

<div id="outline-container-orgb413fb2" class="outline-3">
<h3 id="orgb413fb2">we will use the following format:</h3>
<div class="outline-text-3" id="text-orgb413fb2">
<ul class="org-ul">
<li>in the python lectures we will answer questions that you ask us</li>
<li>in order to prepare these answers, it is useful if you create an issue via <a href="https://github.com/janboone/applied-economics/issues">this link</a>
<ul class="org-ul">
<li>using the link, create an "issue" where you explain what your question is: what did you try and why did it not work?
<ul class="org-ul">
<li>hence not a something like "I do not know the answer to: <b>Question</b> Calculate the total welfare that this planner can achieve. Denote this value <code>max_welfare</code>."</li>
<li>but "I tried to calculate total welfare in the following way &#x2026; but then I get the following error &#x2026;"</li>
<li>describing your question like this, helps you better understand what your problem is</li>
<li>and it helps us to answer the question in class.</li>
</ul></li>
</ul></li>
<li>for us to be able to prepare these answers, submit the issue on the Friday before the week in which we discuss the topic
<ul class="org-ul">
<li>hence, finish the sections in the week before they are discussed in class</li>
<li>if you can solve everything yourself, there is no need to attend the lecture (but you are, of course, welcome to do so)</li>
<li>this is one of the advantages of programming: you can see for yourself whether it works or not.</li>
</ul></li>
</ul>

<p>
A suggested workflow to learn programming efficiently is:
</p>
<ul class="org-ul">
<li>follow the Datacamp courses and make notes of what you learn at Datacamp in a notebook on the jupyterlab server
<ul class="org-ul">
<li>in this way it is easy to refer back to useful code snippets that you see on Datacamp</li>
</ul></li>
<li>go through the jupyter notebook for the lecture and try to answer the questions and assignments</li>
<li>if you get stuck with a problem, watch the corresponding screencast for this part. It gives hints and ways to solve the questions in the notebook</li>
<li>if you still cannot figure it out, create an issue on github to ask us</li>
<li>we will answer your questions in class</li>
</ul>

<p>
Two weeks in November will be focused on gender economics. In the lectures Mery will discuss some papers on this topic. There is a notebook where the models discussed are simulated in Python. These notebooks are then discussed at the end of the week. The notebooks will teach you something about gender economics and Python. At the same time, they show you what we expect you to do in the final assignment for this course: take an existing theory paper and solve the model in Python and simulate outcomes of the model.
</p>

<p>
We highly recommend that you read the book by Jean Tirole to get an idea how you can communicate economic models to a non-economic audience. This will be useful both for your final assignment and for writing your MSc thesis.
</p>

<p>
<b>Remark:</b> We have been teaching this course for a couple of years now. Every year there are a number of students who attend the lectures without preparing anything and watch the screencasts without trying to program themselves. We live in a free country and you choose how to spend your time. However, this strategy does not work well. You actually end up spending far more time on finishing the course than when you follow the planning we suggest below. The reason is as follows: learning a programming language is frustrating. You learn by making mistakes and then trying to figure out what goes wrong. When you make these mistakes during the semester, you are well covered: we are there to help you. When you make these mistakes for the first time when trying to finish your assignment before the deadline, you are in trouble. We will try to help you but not within an hour, or within a day. And because you need to finish before the deadline, you have to figure everything out by yourself under time pressure. Not a pleasant experience and one you can easily avoid. But the choice is yours.
</p>
</div>
</div>
