org-files/index.org
** Lecture schedule
   :PROPERTIES:
   :CUSTOM_ID:       lecture_schedule_AEA
   :END:

At the moment, we believe that the all lectures will be on campus. If we would need to switch to on-line lectures, we will let you know via Canvas

| day |       date |        time | staff          | room    | Topic                                          | Datacamp             |
|-----+------------+-------------+----------------+---------+------------------------------------------------+----------------------|
| Tue | 2022-08-30 | 14:45-16:30 | Boone, J.      | CZ 114  | Intro python, markdown, github, jupyterlab     |                      |
| Wed | 2022-09-07 | 16:45-18:30 | Ladenstein, J  | CZ 7    | Plenary Career Session: see Canvas for details | Intro (3,4)          |
| Mon | 2022-09-12 | 14:45-18:30 | Ladenstein, J. | RTZ 202 | Career workshops: see Canvas for details       | Intermediate (1,2)   |
| Mon | 2022-09-12 | 14:45-18:30 | Boomaars, J.   | RTZ 203 | Career workshops: see Canvas for details       |                      |
| Tue | 2022-09-13 | 12:45-16:30 | Ladenstein, J. | RTZ 103 | Career workshops: see Canvas for details       | Intermediate (3,4,5) |
| Tue | 2022-09-13 | 12:45-16:30 | Boomaars, J.   | RTZ 501 | Career workshops: see Canvas for details       |                      |
| Wed | 2022-09-21 | 12:45-14:30 | CANCELLED      |         |                                                | Pandas (1,2)         |
| Thu | 2022-09-29 | 12:45-14:30 | Boone, J.      | CZ 7    | The market and Asymmetric information          | Pandas (3,4)         |
| Tue | 2022-10-11 | 10:45-12:30 | Boone, J.      | CZ 9    | Financial crisis                               |                      |
| Tue | 2022-11-08 | 10:45-12:30 | Boone, J.      | CZ 9    | Empirical research                             |                      |
| Wed | 2022-11-16 | 10:45-12:30 | Boone, J.      | AZ 201  | Healthcare and regulation                      |                      |
| Mon | 2022-11-21 | 10:45-12:30 | Ferrando, M.   | AZ 201  | Lecture gender economics                       |                      |
| Fri | 2022-11-25 | 12:45-14:30 | Boone, J.      | CZ 7    | notebook gender economics                      |                      |
| Mon | 2022-11-28 | 10:45-12:30 | Ferrando, M.   | AZ 201  | Lecture gender economics                       |                      |
| Fri | 2022-12-02 | 12:45-14:30 | Boone, J.      | CZ 7    | notebook gender economics                      |                      |
| Wed | 2022-12-07 | 12:45-14:30 | Boone, J.      | CZ 7    | Q&A                                            |                      |




** First Lecture

[[file:./Introduction_Lecture.org::#introduction][Introduction Lecture]]

*** Assignment 1
    :PROPERTIES:
    :CUSTOM_ID:       assignment_1_AEA
    :END:

Do the following three steps:
+ create a github account on [[https://github.com/][github]] (you need this account to submit your final assignment)
  + we advise you to do this before **Friday September 16, 2022**
+ go to
  + [[https://jupyterlab.uvt.nl/][jupyter lab]]
    + IT suggests that you use the Firefox browser to access jupyter lab
    + sometimes it helps to access jupyter lab with an incognito/private window
    + or --if all else fails-- you can use [[https://colab.research.google.com/][google's colab]]
+ create a new python notebook and type the following code in the first cell:
#+BEGIN_SRC ipython
%%bash

git clone https://github.com/janboone/applied-economics
#+END_SRC
+ then press the Shift key and Enter key at the same time
+ this creates a folder on the server `applied-economics` that contains the material for the course.
+ Note: you can only run this command once. If you run it again, you get an error since the folder already exists.

*** Final assignment

+ instructions for the final assignment can be found below.

** Datacamp

You can get access to Datacamp via the [[https://www.tilburguniversity.edu/students/skills/programming][university website]].

From Datacamp, do the following courses:

+ Intro: [[https://www.datacamp.com/courses/intro-to-python-for-data-science]]
+ Intermediate: [[https://www.datacamp.com/courses/intermediate-python-for-data-science]]
+ Pandas: https://learn.datacamp.com/courses/data-manipulation-with-pandas

These courses teach you the basic Python syntax. In the lectures and notebook for the course, we use parts of Python more specific to economics; e.g. commands to solve equations, equilibria etc. These parts of the course complement each other. It is not the case that all Python that we use, you will first see in Datacamp.

It is up to you how to combine the Datacamp courses with the [[file:./pagescreencasts.org][Screencasts]]. We suggest to finish the Datacamp Intro course first. As there is no economics on Datacamp, some students prefer to start with the screencasts after the Intro. Others prefer to finish more Datacamp courses before they start on the screencasts. Just see what works for you. But make sure you follow the planning above, otherwise you might get lost if you are too far behind and the lectures will not be as useful to you.

** Deadlines
   :PROPERTIES:
   :CUSTOM_ID: deadlines_AEA
   :END:

- The deadline for the *final python assignment* is: Monday December 19, 2022. Your grade is determined by this final assignment (only).
- The resit deadline for the python assignment is: Monday May 15th, 2023. Let us know by email that you have submitted your assignment for the resit.

Follow the instructions below on how to submit an assignment on github and fill in the google form etc.

Also note the rules for the resit assignment in case you submitted an assignment for the first exam opportunity (you cannot discuss/program the same paper twice for your assignment).

