index.html

<div id="outline-container-lecture_schedule_AEA" class="outline-3">
<h3 id="lecture_schedule_AEA">Lecture schedule</h3>
<div class="outline-text-3" id="text-lecture_schedule_AEA">
<p>
At the moment, we believe that the all lectures will be on campus. If we would need to switch to on-line lectures, we will let you know via Canvas
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">day</th>
<th scope="col" class="org-right">date</th>
<th scope="col" class="org-right">time</th>
<th scope="col" class="org-left">staff</th>
<th scope="col" class="org-left">room</th>
<th scope="col" class="org-left">Topic</th>
<th scope="col" class="org-left">Datacamp</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Tue</td>
<td class="org-right">2022-08-30</td>
<td class="org-right">14:45-16:30</td>
<td class="org-left">Boone, J.</td>
<td class="org-left">CZ 114</td>
<td class="org-left">Intro python, markdown, github, jupyterlab</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Wed</td>
<td class="org-right">2022-09-07</td>
<td class="org-right">16:45-18:30</td>
<td class="org-left">Ladenstein, J</td>
<td class="org-left">CZ 7</td>
<td class="org-left">Plenary Career Session: see Canvas for details</td>
<td class="org-left">Intro (3,4)</td>
</tr>

<tr>
<td class="org-left">Mon</td>
<td class="org-right">2022-09-12</td>
<td class="org-right">14:45-18:30</td>
<td class="org-left">Ladenstein, J.</td>
<td class="org-left">RTZ 202</td>
<td class="org-left">Career workshops: see Canvas for details</td>
<td class="org-left">Intermediate (1,2)</td>
</tr>

<tr>
<td class="org-left">Mon</td>
<td class="org-right">2022-09-12</td>
<td class="org-right">14:45-18:30</td>
<td class="org-left">Boomaars, J.</td>
<td class="org-left">RTZ 203</td>
<td class="org-left">Career workshops: see Canvas for details</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Tue</td>
<td class="org-right">2022-09-13</td>
<td class="org-right">12:45-16:30</td>
<td class="org-left">Ladenstein, J.</td>
<td class="org-left">RTZ 103</td>
<td class="org-left">Career workshops: see Canvas for details</td>
<td class="org-left">Intermediate (3,4,5)</td>
</tr>

<tr>
<td class="org-left">Tue</td>
<td class="org-right">2022-09-13</td>
<td class="org-right">12:45-16:30</td>
<td class="org-left">Boomaars, J.</td>
<td class="org-left">RTZ 501</td>
<td class="org-left">Career workshops: see Canvas for details</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Wed</td>
<td class="org-right">2022-09-21</td>
<td class="org-right">12:45-14:30</td>
<td class="org-left">CANCELLED</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">Pandas (1,2)</td>
</tr>

<tr>
<td class="org-left">Thu</td>
<td class="org-right">2022-09-29</td>
<td class="org-right">12:45-14:30</td>
<td class="org-left">Boone, J.</td>
<td class="org-left">CZ 7</td>
<td class="org-left">The market and Asymmetric information</td>
<td class="org-left">Pandas (3,4)</td>
</tr>

<tr>
<td class="org-left">Tue</td>
<td class="org-right">2022-10-11</td>
<td class="org-right">10:45-12:30</td>
<td class="org-left">Boone, J.</td>
<td class="org-left">CZ 9</td>
<td class="org-left">Financial crisis</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Tue</td>
<td class="org-right">2022-11-08</td>
<td class="org-right">10:45-12:30</td>
<td class="org-left">Boone, J.</td>
<td class="org-left">CZ 9</td>
<td class="org-left">Empirical research</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Wed</td>
<td class="org-right">2022-11-16</td>
<td class="org-right">10:45-12:30</td>
<td class="org-left">Boone, J.</td>
<td class="org-left">AZ 201</td>
<td class="org-left">Healthcare and regulation</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Mon</td>
<td class="org-right">2022-11-21</td>
<td class="org-right">10:45-12:30</td>
<td class="org-left">Ferrando, M.</td>
<td class="org-left">AZ 201</td>
<td class="org-left">Lecture gender economics</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Fri</td>
<td class="org-right">2022-11-25</td>
<td class="org-right">12:45-14:30</td>
<td class="org-left">Boone, J.</td>
<td class="org-left">CZ 7</td>
<td class="org-left">notebook gender economics</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Mon</td>
<td class="org-right">2022-11-28</td>
<td class="org-right">10:45-12:30</td>
<td class="org-left">Ferrando, M.</td>
<td class="org-left">AZ 201</td>
<td class="org-left">Lecture gender economics</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Fri</td>
<td class="org-right">2022-12-02</td>
<td class="org-right">12:45-14:30</td>
<td class="org-left">Boone, J.</td>
<td class="org-left">CZ 7</td>
<td class="org-left">notebook gender economics</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Wed</td>
<td class="org-right">2022-12-07</td>
<td class="org-right">12:45-14:30</td>
<td class="org-left">Boone, J.</td>
<td class="org-left">CZ 7</td>
<td class="org-left">Q&amp;A</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table>
</div>
</div>




<div id="outline-container-org764cdea" class="outline-3">
<h3 id="org764cdea">First Lecture</h3>
<div class="outline-text-3" id="text-org764cdea">
<p>
<a href="./Introduction_Lecture.html#introduction">Introduction Lecture</a>
</p>
</div>

<div id="outline-container-assignment_1_AEA" class="outline-4">
<h4 id="assignment_1_AEA">Assignment 1</h4>
<div class="outline-text-4" id="text-assignment_1_AEA">
<p>
Do the following three steps:
</p>
<ul class="org-ul">
<li>create a github account on <a href="https://github.com/">github</a> (you need this account to submit your final assignment)
<ul class="org-ul">
<li>we advise you to do this before <b><b>Friday September 16, 2022</b></b></li>
</ul></li>
<li>go to
<ul class="org-ul">
<li><a href="https://jupyterlab.uvt.nl/">jupyter lab</a>
<ul class="org-ul">
<li>IT suggests that you use the Firefox browser to access jupyter lab</li>
<li>sometimes it helps to access jupyter lab with an incognito/private window</li>
<li>or &#x2013;if all else fails&#x2013; you can use <a href="https://colab.research.google.com/">google's colab</a></li>
</ul></li>
</ul></li>
<li>create a new python notebook and type the following code in the first cell:</li>
</ul>
<div class="org-src-container">
<pre class="src src-python">%%bash

git clone https://github.com/janboone/applied-economics
</pre>
</div>
<ul class="org-ul">
<li>then press the Shift key and Enter key at the same time</li>
<li>this creates a folder on the server `applied-economics` that contains the material for the course.</li>
<li>Note: you can only run this command once. If you run it again, you get an error since the folder already exists.</li>
</ul>
</div>
</div>

<div id="outline-container-org316b5f6" class="outline-4">
<h4 id="org316b5f6">Final assignment</h4>
<div class="outline-text-4" id="text-org316b5f6">
<ul class="org-ul">
<li>instructions for the final assignment can be found below.</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org30625a3" class="outline-3">
<h3 id="org30625a3">Datacamp</h3>
<div class="outline-text-3" id="text-org30625a3">
<p>
You can get access to Datacamp via the <a href="https://www.tilburguniversity.edu/students/skills/programming">university website</a>.
</p>

<p>
From Datacamp, do the following courses:
</p>

<ul class="org-ul">
<li>Intro: <a href="https://www.datacamp.com/courses/intro-to-python-for-data-science">https://www.datacamp.com/courses/intro-to-python-for-data-science</a></li>
<li>Intermediate: <a href="https://www.datacamp.com/courses/intermediate-python-for-data-science">https://www.datacamp.com/courses/intermediate-python-for-data-science</a></li>
<li>Pandas: <a href="https://learn.datacamp.com/courses/data-manipulation-with-pandas">https://learn.datacamp.com/courses/data-manipulation-with-pandas</a></li>
</ul>

<p>
These courses teach you the basic Python syntax. In the lectures and notebook for the course, we use parts of Python more specific to economics; e.g. commands to solve equations, equilibria etc. These parts of the course complement each other. It is not the case that all Python that we use, you will first see in Datacamp.
</p>

<p>
It is up to you how to combine the Datacamp courses with the <a href="./pagescreencasts.html">Screencasts</a>. We suggest to finish the Datacamp Intro course first. As there is no economics on Datacamp, some students prefer to start with the screencasts after the Intro. Others prefer to finish more Datacamp courses before they start on the screencasts. Just see what works for you. But make sure you follow the planning above, otherwise you might get lost if you are too far behind and the lectures will not be as useful to you.
</p>
</div>
</div>

<div id="outline-container-deadlines_AEA" class="outline-3">
<h3 id="deadlines_AEA">Deadlines</h3>
<div class="outline-text-3" id="text-deadlines_AEA">
<ul class="org-ul">
<li>The deadline for the <b>final python assignment</b> is: Monday January 9th, 2023. Your grade is determined by this final assignment (only).</li>
<li>The resit deadline for the python assignment is: Monday May 15th, 2023. Let us know by email that you have submitted your assignment for the resit.</li>
</ul>

<p>
Follow the instructions below on how to submit an assignment on github and fill in the google form etc.
</p>

<p>
Also note the rules for the resit assignment in case you submitted an assignment for the first exam opportunity (you cannot discuss/program the same paper twice for your assignment).
</p>
</div>
</div>
