org-files/index.org
** Questions

 If you have questions/comments about this course, go to the [[https://github.com/janboone/applied-economics/issues][issues page]]
 open a new issue (with the green "New issue" button) and type your
 question. Use a title that is informative (e.g. not "question", but
 "question about the second assignment"). Go to the next box ("Leave a comment")
 and type your question. Then click on "Submit new issue". We will
 answer your question as quickly as possible.

 The advantages of the issue page include:

 + if you have a question, other students may have it as well; in this
   way we answer the questions in a way that everyone can see it. Also
   before asking the question, you may want to check whether it was
   asked/answered before on the issue page
 + we answer your question more quickly than when you email us
 + you increase your knowledge of github!

 Only when you need to include privately sensitive information ("my cat
 has passed away"), you can send an email.

 In order to post issues, you need to create a github account (which
 you need anyway to follow this course).

 Note that if your question is related to another issue, you can react
 to the earlier issue and leave a comment in that "conversation".



* Final Assignment
  :PROPERTIES:
  :CUSTOM_ID: final_assignment_AEA
  :END:

+ The python assignment you can do alone or with at max. one other student (i.e. max group size is 2).
+ for the deadline of the python assignment, see [[Deadlines]] above
+ on Canvas we will give you the link to the github repos. with the ~assignment_template.ipynb~
+ once you have "cloned" the applied-economics repository, you can see there the ~assignment_template.ipynb~ notebook. This gives you an idea of the template for the final assignment
+ to submit your final assignment:
  + do not change the name of the ~assignment_template.ipynb~ notebook
  + fill in this [[https://forms.gle/Fri5MZc9J2wbzhim7][google form]]
  + push the final notebook on the github classroom repository


** TODO Instructions for submitting final assignment to be put on Canvas :noexport:

- [ ] create assignment on github classroom with the AEA/datascience template/notebook: https://github.com/janboone/AEA_final_assignment or https://github.com/janboone/datascience_assignment_template
- [ ] my link for 2022/3 is https://classroom.github.com/classrooms/16413080-tisem-aea/assignments/assignment-2022-2023
- within classroom TiSEM-AEA: https://classroom.github.com/classrooms/16413080-tisem-aea
- [ ] set deadline in github classroom
- [ ] create google form for students to fill in once they finish assignment: replace link above (is for 2022/2023)
- [ ] change link to the classroom assignment below

- attach instructions: [[file:~/Google Drive/repositories/github/websites/github_classroom_assignments/how_to_use_nbgrader_github_classroom/Manual_students.pdf]]
- create and post screencast where notebook is downloaded and uploaded on github
- show previous step during lecture


Dear students,

The link for the final AEA python assignment (template) is: https://classroom.github.com/a/xvoMJs8z (this is the link for 2022/2023)

You can do the assignment on your own or with (at max.) one other student. When you use the link to the assignment, you will be asked for your team's name. Choose your favorite name!

When you finish your assignment:

1. download your assignment (jupyter notebook) from jupyter lab (or google colabs; or check where it is on your computer when using anaconda) to your computer (e.g. in the folder Downloads)

2. push it onto your assignment's github repository

3. fill in the google form where the link to the form is on the website: https://janboone.github.io/applied-economics/index.html#final_assignment_AEA

We need the information from the google form to link your assignment to your student number which is needed for the exam administration.

If you have questions about the assignment or the procedure described above, create an issue on the webpage at: https://github.com/janboone/applied-economics/issues

Then you can see whether other students had the same question (which was already answered) or fellow-students can learn from your question. These issues can be read by anyone, so do not provide any privacy related information.

Good luck with the assignment,

Jan.

** what we are looking for

The idea of the assignment is that you report your findings in a transparent way that can easily be verified/reproduced by others. The intended audience is your fellow students. They should be able to understand the code you write together with the explanations that you give for this code.

The following ingredients will be important when we evaluate your assignment:

+ Start from a theory paper; e.g. one you have read for another course.
+ Briefly describe what the paper does and what the main results are.
+ Then formulate a clear and transparent *question* that cannot be immediately answered by the paper.
  + Extend the paper's model (a bit) using the fact that you will simulate the model and do not need to provide an analytical solution.
    + note: we do not expect a major extension of the model; just a small change and use simulations to show how results differ due to this adaptation of the model.
    + hint: choose a question/extension where you can show off your programming skills!
+ Briefly *motivate* why this question is interesting.
+ Give the *answer* that you find (as a preview).
+ Mention the main *assumptions* that you need to get this answer.
+ Use latex to introduce and explain the model of the paper. Describe the main equations (using latex) of the model.
+ When you use information (e.g. a literature reference), create a link to this information. The reader then only needs to click to find the relevant information.
+ Describe your (small) extension of the model.
+ Explain how you move from the analytical equations of the paper to Python code.
+ Solve for the equilibrium using Python.
+ Simulate outcomes by using different values for parameters and save the outcomes of the simulations in a pandas dataframe.
+ Explain your code, the reader --think of your fellow students-- must be able to easily follow what you are doing.
+ Present graphs of your simulation results.
+ Discuss what the figures show (e.g. $x$ is increasing in $y$) and explain the economic intuition for this relation (between $x$ and $y$).
+ Present a clear conclusion/answer to your question.
+ Finish with a brief *discussion* of your results.

Remark:
+ you can copy code from the web; but
  + make sure that you explain the code that you use so that another student of the course understands it and can use it;
  + give the reference of the code that you copy.


** resit of final assignment

The resit of the final assignment needs to start from a new paper compared to the one you handed in before. Simply adjusting your first submission based on our feedback will be not be enough.

Otherwise, follow the procedure above on how to submit the assignment and fill in the google form.


