index.html

<div id="outline-container-org7e58d60" class="outline-3">
<h3 id="org7e58d60">Questions</h3>
<div class="outline-text-3" id="text-org7e58d60">
<p>
If you have questions/comments about this course, go to the <a href="https://github.com/janboone/applied-economics/issues">issues page</a>
open a new issue (with the green "New issue" button) and type your
question. Use a title that is informative (e.g. not "question", but
"question about the second assignment"). Go to the next box ("Leave a comment")
and type your question. Then click on "Submit new issue". We will
answer your question as quickly as possible.
</p>

<p>
The advantages of the issue page include:
</p>

<ul class="org-ul">
<li>if you have a question, other students may have it as well; in this
way we answer the questions in a way that everyone can see it. Also
before asking the question, you may want to check whether it was
asked/answered before on the issue page</li>
<li>we answer your question more quickly than when you email us</li>
<li>you increase your knowledge of github!</li>
</ul>

<p>
Only when you need to include privately sensitive information ("my cat
has passed away"), you can send an email.
</p>

<p>
In order to post issues, you need to create a github account (which
you need anyway to follow this course).
</p>

<p>
Note that if your question is related to another issue, you can react
to the earlier issue and leave a comment in that "conversation".
</p>
</div>
</div>
</div>



<div id="outline-container-final_assignment_AEA" class="outline-2">
<h2 id="final_assignment_AEA">Final Assignment</h2>
<div class="outline-text-2" id="text-final_assignment_AEA">
<ul class="org-ul">
<li>The python assignment you can do alone or with at max. one other student (i.e. max group size is 2).</li>
<li>for the deadline of the python assignment, see <a href="#deadlines_AEA">Deadlines</a> above</li>
<li>on Canvas we will give you the link to the github repos. with the <code>assignment_template.ipynb</code></li>
<li>once you have "cloned" the applied-economics repository, you can see there the <code>assignment_template.ipynb</code> notebook. This gives you an idea of the template for the final assignment</li>
<li>to submit your final assignment:
<ul class="org-ul">
<li>do not change the name of the <code>assignment_template.ipynb</code> notebook</li>
<li>fill in this <a href="https://forms.gle/Fri5MZc9J2wbzhim7">google form</a></li>
<li>push the final notebook on the github classroom repository</li>
</ul></li>
</ul>
</div>


<div id="outline-container-org75faf65" class="outline-3">
<h3 id="org75faf65">what we are looking for</h3>
<div class="outline-text-3" id="text-org75faf65">
<p>
The idea of the assignment is that you report your findings in a transparent way that can easily be verified/reproduced by others. The intended audience is your fellow students. They should be able to understand the code you write together with the explanations that you give for this code.
</p>

<p>
The following ingredients will be important when we evaluate your assignment:
</p>

<ul class="org-ul">
<li>Start from a theory paper; e.g. one you have read for another course.</li>
<li>Briefly describe what the paper does and what the main results are.</li>
<li>Then formulate a clear and transparent <b>question</b> that cannot be immediately answered by the paper.
<ul class="org-ul">
<li>Extend the paper's model (a bit) using the fact that you will simulate the model and do not need to provide an analytical solution.
<ul class="org-ul">
<li>note: we do not expect a major extension of the model; just a small change and use simulations to show how results differ due to this adaptation of the model.</li>
<li>hint: choose a question/extension where you can show off your programming skills!</li>
</ul></li>
</ul></li>
<li>Briefly <b>motivate</b> why this question is interesting.</li>
<li>Give the <b>answer</b> that you find (as a preview).</li>
<li>Mention the main <b>assumptions</b> that you need to get this answer.</li>
<li>Use latex to introduce and explain the model of the paper. Describe the main equations (using latex) of the model.</li>
<li>When you use information (e.g. a literature reference), create a link to this information. The reader then only needs to click to find the relevant information.</li>
<li>Describe your (small) extension of the model.</li>
<li>Explain how you move from the analytical equations of the paper to Python code.</li>
<li>Solve for the equilibrium using Python.</li>
<li>Simulate outcomes by using different values for parameters and save the outcomes of the simulations in a pandas dataframe.</li>
<li>Explain your code, the reader &#x2013;think of your fellow students&#x2013; must be able to easily follow what you are doing.</li>
<li>Present graphs of your simulation results.</li>
<li>Discuss what the figures show (e.g. \(x\) is increasing in \(y\)) and explain the economic intuition for this relation (between \(x\) and \(y\)).</li>
<li>Present a clear conclusion/answer to your question.</li>
<li>Finish with a brief <b>discussion</b> of your results.</li>
</ul>

<p>
Remark:
</p>
<ul class="org-ul">
<li>you can copy code from the web; but
<ul class="org-ul">
<li>make sure that you explain the code that you use so that another student of the course understands it and can use it;</li>
<li>give the reference of the code that you copy.</li>
</ul></li>
</ul>
</div>
</div>


<div id="outline-container-orge9ee6a9" class="outline-3">
<h3 id="orge9ee6a9">resit of final assignment</h3>
<div class="outline-text-3" id="text-orge9ee6a9">
<p>
The resit of the final assignment needs to start from a new paper compared to the one you handed in before. Simply adjusting your first submission based on our feedback will be not be enough.
</p>

<p>
Otherwise, follow the procedure above on how to submit the assignment and fill in the google form.
</p>
</div>
</div>
</div>
