org-files/index.org
* Python as programming language

We use Python as programming language. A fair question is:
why Python? The non-scientific answer is: because we like it a lot.

Other answers, better motivated than this, include:

- https://www.datacamp.com/community/blog/python-scientific-computing-case
- https://developer.ibm.com/blogs/use-python-for-scientific-research/
- google the question if you want more answers.

We will program Python using the jupyter notebook. One motivation to use the jupyter notebook is based on a paper in the AER:

[[yt:oP9Qcjq8UVI]]

Note that this is a presentation on a Python conference having nothing to do with economics. The fact that this presentation uses an AER paper to motivate using the notebook (instead of an excel file), may induce a pause in which you ponder the state of our discipline.

After this pause, take a look at some notebooks:
- https://github.com/jupyter/jupyter/wiki


Links and resources for python:

+ [[https://scipy-lectures.github.io/]]
+ [[http://www.physics.nyu.edu/pine/pymanual/html/pymanMaster.html]]
+ https://aeturrell.github.io/coding-for-economists/intro.html (introduction to python with economics in mind)
+ https://python.quantecon.org/intro.html (fairly advanced economics with python)
+ [[https://www.youtube.com/playlist?list=PLi01XoE8jYohWFPpC17Z-wWhPOSuh8Er-]] (video lectures on a number of python topics)

** Jupyter notebooks


*** Markdown

For the assignment it is useful to know a bit of markdown. You can
either google "markdown tutorial" or use one of the following websites:

+ [[http://daringfireball.net/projects/markdown/]]
+ [[https://github.com/adam-p/markdown-here/wiki/Markdown-Cheatsheet]]

*** Latex

For the python assignment it is useful to familiarize yourself with
latex. Note that you do not need to type a whole document in latex (so
don't worry about preambles etc.), you just need to know how to type
$x^2$, $\alpha,\beta$ or have math displayed like

\begin{equation}
a^2 + b^2 = c^2
\end{equation}

Google "latex tutorial" or go to pages like:

+ [[http://users.dickinson.edu/~richesod/latex/latexcheatsheet.pdf]]
+ [[https://www.latex-tutorial.com/tutorials/amsmath/]]
+ [[http://www.andy-roberts.net/writing/latex/mathematics_1]]

and focus on typesetting.
