index.html


<div id="outline-container-org615c70e" class="outline-2">
<h2 id="org615c70e">Python as programming language</h2>
<div class="outline-text-2" id="text-org615c70e">
<p>
We use Python as programming language. A fair question is:
why Python? The non-scientific answer is: because we like it a lot.
</p>

<p>
Other answers, better motivated than this, include:
</p>

<ul class="org-ul">
<li><a href="https://www.datacamp.com/community/blog/python-scientific-computing-case">https://www.datacamp.com/community/blog/python-scientific-computing-case</a></li>
<li><a href="https://developer.ibm.com/blogs/use-python-for-scientific-research/">https://developer.ibm.com/blogs/use-python-for-scientific-research/</a></li>
<li>google the question if you want more answers.</li>
</ul>

<p>
We will program Python using the jupyter notebook. One motivation to use the jupyter notebook is based on a paper in the AER:
</p>

<p>
<iframe width="660" height="503" src="https://www.youtube.com/embed/oP9Qcjq8UVI" frameborder="0" allowfullscreen></iframe>
</p>

<p>
Note that this is a presentation on a Python conference having nothing to do with economics. The fact that this presentation uses an AER paper to motivate using the notebook (instead of an excel file), may induce a pause in which you ponder the state of our discipline.
</p>

<p>
After this pause, take a look at some notebooks:
</p>
<ul class="org-ul">
<li><a href="https://github.com/jupyter/jupyter/wiki">https://github.com/jupyter/jupyter/wiki</a></li>
</ul>


<p>
Links and resources for python:
</p>

<ul class="org-ul">
<li><a href="https://scipy-lectures.github.io/">https://scipy-lectures.github.io/</a></li>
<li><a href="http://www.physics.nyu.edu/pine/pymanual/html/pymanMaster.html">http://www.physics.nyu.edu/pine/pymanual/html/pymanMaster.html</a></li>
<li><a href="https://aeturrell.github.io/coding-for-economists/intro.html">https://aeturrell.github.io/coding-for-economists/intro.html</a> (introduction to python with economics in mind)</li>
<li><a href="https://python.quantecon.org/intro.html">https://python.quantecon.org/intro.html</a> (fairly advanced economics with python)</li>
<li><a href="https://www.youtube.com/playlist?list=PLi01XoE8jYohWFPpC17Z-wWhPOSuh8Er-">https://www.youtube.com/playlist?list=PLi01XoE8jYohWFPpC17Z-wWhPOSuh8Er-</a> (video lectures on a number of python topics)</li>
</ul>
</div>

<div id="outline-container-orge16ffe4" class="outline-3">
<h3 id="orge16ffe4">Jupyter notebooks</h3>
<div class="outline-text-3" id="text-orge16ffe4">
</div>
<div id="outline-container-orgc3894b2" class="outline-4">
<h4 id="orgc3894b2">Markdown</h4>
<div class="outline-text-4" id="text-orgc3894b2">
<p>
For the assignment it is useful to know a bit of markdown. You can
either google "markdown tutorial" or use one of the following websites:
</p>

<ul class="org-ul">
<li><a href="http://daringfireball.net/projects/markdown/">http://daringfireball.net/projects/markdown/</a></li>
<li><a href="https://github.com/adam-p/markdown-here/wiki/Markdown-Cheatsheet">https://github.com/adam-p/markdown-here/wiki/Markdown-Cheatsheet</a></li>
</ul>
</div>
</div>

<div id="outline-container-org8e89b19" class="outline-4">
<h4 id="org8e89b19">Latex</h4>
<div class="outline-text-4" id="text-org8e89b19">
<p>
For the python assignment it is useful to familiarize yourself with
latex. Note that you do not need to type a whole document in latex (so
don't worry about preambles etc.), you just need to know how to type
\(x^2\), \(\alpha,\beta\) or have math displayed like
</p>

\begin{equation}
a^2 + b^2 = c^2
\end{equation}

<p>
Google "latex tutorial" or go to pages like:
</p>

<ul class="org-ul">
<li><a href="http://users.dickinson.edu/~richesod/latex/latexcheatsheet.pdf">http://users.dickinson.edu/~richesod/latex/latexcheatsheet.pdf</a></li>
<li><a href="https://www.latex-tutorial.com/tutorials/amsmath/">https://www.latex-tutorial.com/tutorials/amsmath/</a></li>
<li><a href="http://www.andy-roberts.net/writing/latex/mathematics_1">http://www.andy-roberts.net/writing/latex/mathematics_1</a></li>
</ul>

<p>
and focus on typesetting.
</p>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Jan Boone</p>
</div>
</body>
</html>
